
&НаСервере
Процедура ПостроитьОтчетНаСервере()
	Дер = ПромышленностьВызовСервера.ПостроитьДерево();
	ЗначениеВРеквизитФормы(Дер, "Дерево");
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьОтчет(Команда)
	ПостроитьОтчетНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	ОткрытьФорму("Справочник.пПартия.ФормаОбъекта", Новый Структура("Ключ", ТекДанные.Партия));
КонецПроцедуры
