
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	пПартия.Ссылка КАК Партия
		|ИЗ
		|	Справочник.пПартия КАК пПартия
		|ГДЕ
		|	пПартия.Участник = &Участник";
	Запрос.УстановитьПараметр("Участник", Константы.пНашУчастник.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РезТаб = РезультатЗапроса.Выгрузить();
	ЗначениеВРеквизитФормы(РезТаб, "Таблица");

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	SKU = Элемент.ТекущиеДанные.Партия;
	
	ОткрытьФорму("Справочник.пПартия.ФормаОбъекта", Новый Структура("Ключ", SKU));
КонецПроцедуры
