
&НаКлиенте
Процедура ДанныеУчастникаНажатие(Элемент)
	НашУчастник = НашУчастник();
	ОткрытьФорму("Справочник.пУчастники.ФормаОбъекта", Новый Структура("Ключ", НашУчастник));
КонецПроцедуры

 &НаСервере
 Функция НашУчастник()
	 Возврат Константы.пНашУчастник.Получить();
 КонецФункции


&НаКлиенте
 Процедура ПартииНажатие(Элемент)
	 ОткрытьФорму("Обработка.пПромышленность.Форма.Партии");
 КонецПроцедуры


&НаКлиенте
 Процедура ПроисхождениеНажатие(Элемент)
	 ОткрытьФорму("Обработка.пПромышленность.Форма.Происхождение");
 КонецПроцедуры
 