
&НаКлиенте
Процедура ОборудованиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ОткрытьФорму("Справочник.пОборудование.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.Оборудование));
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ОткрытьФорму("Справочник.пSKU.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.Номенклатура));
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
